
#include <iostream>

using namespace std;

int main()
{
    // Задача Begin 8
    // Дано два числа a і b. Знайти їх середнє арифметичне: (a + b) / 2.
    
    cout << "===== Задача Begin 8 =====" << endl;

    // Декларація змінних
    double a, b;

    // Вводимо два числа
    cout << "Введіть число a: ";
    cin >> a;

    cout << "Введіть число b: ";
    cin >> b;

    // Знаходимо середнє арифметичне
    cout << "Середнє арифметичне: " << (a + b) / 2 << endl;


    
    // Задача Begin 34
    // Дано три числа. Знайти їх середнє арифметичне: (a + b + c)/3.
    
    cout << endl;
    cout << " Задача Begin 34 " << endl;

    // Декларація змінних
    double c;

    // Вводимо три числа
    cout << "Введіть число a: ";
    cin >> a;

    cout << "Введіть число b: ";
    cin >> b;

    cout << "Введіть число c: ";
    cin >> c;

    // Знаходимо середнє арифметичне
    cout << "Середнє арифметичне: " << (a + b + c) / 3 << endl;



    // Задача Begin 35
    // Дано три числа. Знайти суму їх квадратів: a2 + b2 + c2.
    
    cout << endl;
    cout << " Задача Begin 35 " << endl;

    // Декларація змінних вже написана 
   
    
    // Вводимо три числа
    cout << "Введіть число a: ";
    cin >> a;

    cout << "Введіть число b: ";
    cin >> b;

    cout << "Введіть число c: ";
    cin >> c;

    // Знаходимо суму квадратів
    cout << "Сума квадратів: "  << (a * a + b * b + c * c) << endl;

    return 0;
}